{
    "dsl_version": 2,
    "initiator": {
        "role": "guest",
        "party_id": 9999
    },
    "role": {
        "host": [
            10000
        ],
        "guest": [
            9999
        ]
    },
    "component_parameters": {
        "role": {
            "guest": {
                "0": {
                    "reader_1": {
                        "table": {
                            "name": "breast_hetero_guest",
                            "namespace": "experiment"
                        }
                    },
                    "data_transform_1": {
                        "with_label": true
                    },
                    "hetero_nn_0": {
                        "bottom_nn_define": {
                            "class_name": "Sequential",
                            "config": {
                                "name": "sequential",
                                "layers": [
                                    {
                                        "class_name": "InputLayer",
                                        "config": {
                                            "batch_input_shape": [
                                                null,
                                                10
                                            ],
                                            "dtype": "float32",
                                            "sparse": false,
                                            "ragged": false,
                                            "name": "dense_input"
                                        }
                                    },
                                    {
                                        "class_name": "Dense",
                                        "config": {
                                            "name": "dense",
                                            "trainable": true,
                                            "batch_input_shape": [
                                                null,
                                                10
                                            ],
                                            "dtype": "float32",
                                            "units": 3,
                                            "activation": "relu",
                                            "use_bias": true,
                                            "kernel_initializer": {
                                                "class_name": "Constant",
                                                "config": {
                                                    "value": 1
                                                }
                                            },
                                            "bias_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "kernel_regularizer": null,
                                            "bias_regularizer": null,
                                            "activity_regularizer": null,
                                            "kernel_constraint": null,
                                            "bias_constraint": null
                                        }
                                    }
                                ]
                            },
                            "keras_version": "2.4.0",
                            "backend": "tensorflow"
                        },
                        "top_nn_define": {
                            "class_name": "Sequential",
                            "config": {
                                "name": "sequential_2",
                                "layers": [
                                    {
                                        "class_name": "InputLayer",
                                        "config": {
                                            "batch_input_shape": [
                                                null,
                                                2
                                            ],
                                            "dtype": "float32",
                                            "sparse": false,
                                            "ragged": false,
                                            "name": "dense_2_input"
                                        }
                                    },
                                    {
                                        "class_name": "Dense",
                                        "config": {
                                            "name": "dense_2",
                                            "trainable": true,
                                            "batch_input_shape": [
                                                null,
                                                2
                                            ],
                                            "dtype": "float32",
                                            "units": 1,
                                            "activation": "sigmoid",
                                            "use_bias": true,
                                            "kernel_initializer": {
                                                "class_name": "Constant",
                                                "config": {
                                                    "value": 1
                                                }
                                            },
                                            "bias_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "kernel_regularizer": null,
                                            "bias_regularizer": null,
                                            "activity_regularizer": null,
                                            "kernel_constraint": null,
                                            "bias_constraint": null
                                        }
                                    }
                                ]
                            },
                            "keras_version": "2.4.0",
                            "backend": "tensorflow"
                        },
                        "interactive_layer_define": {
                            "class_name": "Sequential",
                            "config": {
                                "name": "sequential_1",
                                "layers": [
                                    {
                                        "class_name": "InputLayer",
                                        "config": {
                                            "batch_input_shape": [
                                                null,
                                                2
                                            ],
                                            "dtype": "float32",
                                            "sparse": false,
                                            "ragged": false,
                                            "name": "dense_1_input"
                                        }
                                    },
                                    {
                                        "class_name": "Dense",
                                        "config": {
                                            "name": "dense_1",
                                            "trainable": true,
                                            "batch_input_shape": [
                                                null,
                                                2
                                            ],
                                            "dtype": "float32",
                                            "units": 2,
                                            "activation": "linear",
                                            "use_bias": true,
                                            "kernel_initializer": {
                                                "class_name": "Constant",
                                                "config": {
                                                    "value": 1
                                                }
                                            },
                                            "bias_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "kernel_regularizer": null,
                                            "bias_regularizer": null,
                                            "activity_regularizer": null,
                                            "kernel_constraint": null,
                                            "bias_constraint": null
                                        }
                                    }
                                ]
                            },
                            "keras_version": "2.4.0",
                            "backend": "tensorflow"
                        }
                    },
                    "reader_0": {
                        "table": {
                            "name": "breast_hetero_guest",
                            "namespace": "experiment"
                        }
                    },
                    "data_transform_0": {
                        "with_label": true
                    }
                }
            },
            "host": {
                "0": {
                    "reader_1": {
                        "table": {
                            "name": "breast_hetero_host",
                            "namespace": "experiment"
                        }
                    },
                    "data_transform_1": {
                        "with_label": false
                    },
                    "hetero_nn_0": {
                        "bottom_nn_define": {
                            "class_name": "Sequential",
                            "config": {
                                "name": "sequential_3",
                                "layers": [
                                    {
                                        "class_name": "InputLayer",
                                        "config": {
                                            "batch_input_shape": [
                                                null,
                                                20
                                            ],
                                            "dtype": "float32",
                                            "sparse": false,
                                            "ragged": false,
                                            "name": "dense_3_input"
                                        }
                                    },
                                    {
                                        "class_name": "Dense",
                                        "config": {
                                            "name": "dense_3",
                                            "trainable": true,
                                            "batch_input_shape": [
                                                null,
                                                20
                                            ],
                                            "dtype": "float32",
                                            "units": 3,
                                            "activation": "relu",
                                            "use_bias": true,
                                            "kernel_initializer": {
                                                "class_name": "Constant",
                                                "config": {
                                                    "value": 1
                                                }
                                            },
                                            "bias_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "kernel_regularizer": null,
                                            "bias_regularizer": null,
                                            "activity_regularizer": null,
                                            "kernel_constraint": null,
                                            "bias_constraint": null
                                        }
                                    }
                                ]
                            },
                            "keras_version": "2.4.0",
                            "backend": "tensorflow"
                        },
                        "interactive_layer_define": {
                            "class_name": "Sequential",
                            "config": {
                                "name": "sequential_4",
                                "layers": [
                                    {
                                        "class_name": "InputLayer",
                                        "config": {
                                            "batch_input_shape": [
                                                null,
                                                2
                                            ],
                                            "dtype": "float32",
                                            "sparse": false,
                                            "ragged": false,
                                            "name": "dense_4_input"
                                        }
                                    },
                                    {
                                        "class_name": "Dense",
                                        "config": {
                                            "name": "dense_4",
                                            "trainable": true,
                                            "batch_input_shape": [
                                                null,
                                                2
                                            ],
                                            "dtype": "float32",
                                            "units": 2,
                                            "activation": "linear",
                                            "use_bias": true,
                                            "kernel_initializer": {
                                                "class_name": "Constant",
                                                "config": {
                                                    "value": 1
                                                }
                                            },
                                            "bias_initializer": {
                                                "class_name": "Zeros",
                                                "config": {}
                                            },
                                            "kernel_regularizer": null,
                                            "bias_regularizer": null,
                                            "activity_regularizer": null,
                                            "kernel_constraint": null,
                                            "bias_constraint": null
                                        }
                                    }
                                ]
                            },
                            "keras_version": "2.4.0",
                            "backend": "tensorflow"
                        }
                    },
                    "reader_0": {
                        "table": {
                            "name": "breast_hetero_host",
                            "namespace": "experiment"
                        }
                    },
                    "data_transform_0": {
                        "with_label": false
                    }
                }
            }
        },
        "common": {
            "hetero_nn_0": {
                "epochs": 100,
                "interactive_layer_lr": 0.15,
                "batch_size": -1,
                "early_stop": "diff",
                "callback_param": {
                    "callbacks": [
                        "EarlyStopping"
                    ],
                    "validation_freqs": 1,
                    "early_stopping_rounds": 15,
                    "use_first_metric_only": true,
                    "metrics": [
                        "AUC"
                    ]
                },
                "optimizer": {
                    "learning_rate": 0.15,
                    "decay": 0.0,
                    "momentum": 0.0,
                    "nesterov": false,
                    "optimizer": "SGD"
                },
                "loss": "binary_crossentropy",
                "bottom_nn_define": null,
                "top_nn_define": null,
                "interactive_layer_define": null,
                "config_type": "keras"
            },
            "hetero_nn_1": {
                "optimizer": null,
                "bottom_nn_define": null,
                "top_nn_define": null,
                "interactive_layer_define": null,
                "config_type": "keras"
            }
        }
    }
}