{
    "dsl_version": 2,
    "initiator": {
        "role": "guest",
        "party_id": 9999
    },
    "role": {
        "host": [
            9998
        ],
        "guest": [
            9999
        ]
    },
    "component_parameters": {
        "common": {
            "hetero_nn_0": {
                "epochs": 10,
                "interactive_layer_lr": 0.15,
                "batch_size": -1,
                "early_stop": "diff",
                "optimizer": {
                    "learning_rate": 0.15,
                    "decay": 0.0,
                    "momentum": 0.0,
                    "nesterov": false,
                    "optimizer": "SGD"
                },
                "loss": "binary_crossentropy",
                "floating_point_precision": 23,
                "bottom_nn_define": {
                    "class_name": "Sequential",
                    "config": {
                        "name": "sequential",
                        "layers": [
                            {
                                "class_name": "Dense",
                                "config": {
                                    "name": "dense",
                                    "trainable": true,
                                    "batch_input_shape": [
                                        null,
                                        10
                                    ],
                                    "dtype": "float32",
                                    "units": 3,
                                    "activation": "relu",
                                    "use_bias": true,
                                    "kernel_initializer": {
                                        "class_name": "Constant",
                                        "config": {
                                            "value": 1,
                                            "dtype": "float32"
                                        }
                                    },
                                    "bias_initializer": {
                                        "class_name": "Zeros",
                                        "config": {
                                            "dtype": "float32"
                                        }
                                    },
                                    "kernel_regularizer": null,
                                    "bias_regularizer": null,
                                    "activity_regularizer": null,
                                    "kernel_constraint": null,
                                    "bias_constraint": null
                                }
                            }
                        ]
                    },
                    "keras_version": "2.2.4-tf",
                    "backend": "tensorflow"
                },
                "top_nn_define": {
                    "class_name": "Sequential",
                    "config": {
                        "name": "sequential_2",
                        "layers": [
                            {
                                "class_name": "Dense",
                                "config": {
                                    "name": "dense_2",
                                    "trainable": true,
                                    "batch_input_shape": [
                                        null,
                                        2
                                    ],
                                    "dtype": "float32",
                                    "units": 1,
                                    "activation": "sigmoid",
                                    "use_bias": true,
                                    "kernel_initializer": {
                                        "class_name": "Constant",
                                        "config": {
                                            "value": 1,
                                            "dtype": "float32"
                                        }
                                    },
                                    "bias_initializer": {
                                        "class_name": "Zeros",
                                        "config": {
                                            "dtype": "float32"
                                        }
                                    },
                                    "kernel_regularizer": null,
                                    "bias_regularizer": null,
                                    "activity_regularizer": null,
                                    "kernel_constraint": null,
                                    "bias_constraint": null
                                }
                            }
                        ]
                    },
                    "keras_version": "2.2.4-tf",
                    "backend": "tensorflow"
                },
                "interactive_layer_define": {
                    "class_name": "Sequential",
                    "config": {
                        "name": "sequential_1",
                        "layers": [
                            {
                                "class_name": "Dense",
                                "config": {
                                    "name": "dense_1",
                                    "trainable": true,
                                    "batch_input_shape": [
                                        null,
                                        2
                                    ],
                                    "dtype": "float32",
                                    "units": 2,
                                    "activation": "linear",
                                    "use_bias": true,
                                    "kernel_initializer": {
                                        "class_name": "Constant",
                                        "config": {
                                            "value": 1,
                                            "dtype": "float32"
                                        }
                                    },
                                    "bias_initializer": {
                                        "class_name": "Zeros",
                                        "config": {
                                            "dtype": "float32"
                                        }
                                    },
                                    "kernel_regularizer": null,
                                    "bias_regularizer": null,
                                    "activity_regularizer": null,
                                    "kernel_constraint": null,
                                    "bias_constraint": null
                                }
                            }
                        ]
                    },
                    "keras_version": "2.2.4-tf",
                    "backend": "tensorflow"
                },
                "config_type": "keras"
            },
            "hetero_nn_1": {
                "optimizer": null,
                "bottom_nn_define": null,
                "top_nn_define": null,
                "interactive_layer_define": null,
                "config_type": "keras"
            }
        },
        "role": {
            "guest": {
                "0": {
                    "reader_0": {
                        "table": {
                            "name": "default_credit_hetero_guest",
                            "namespace": "experiment"
                        }
                    },
                    "data_transform_0": {
                        "with_label": true
                    }
                }
            },
            "host": {
                "0": {
                    "reader_0": {
                        "table": {
                            "name": "default_credit_hetero_host",
                            "namespace": "experiment"
                        }
                    },
                    "data_transform_0": {
                        "with_label": false
                    }
                }
            }
        }
    }
}