{
    "initiator": {
        "role": "guest",
        "party_id": 10000
    },
    "job_parameters": {
        "work_mode": 0
    },
    "role": {
        "guest": [10000],
        "host": [10000]
    },
    "role_parameters": {
        "guest": {
            "args": {
                "data": {
                    "train_data": [{"name": "nus_wide_guest", "namespace": "experiment"}],
                    "eval_data": [{"name": "nus_wide_guest_val", "namespace": "experiment"}]
                }
            },
            "dataio_0":{
                "with_label": [true],
                "label_name": ["y"],
                "label_type": ["int"],
                "output_format": ["dense"]
            }
        },
        "host": {
            "args": {
                "data": {
                    "train_data": [{"name": "nus_wide_host", "namespace": "experiment"}],
                    "eval_data": [{"name": "nus_wide_host_val", "namespace": "experiment"}]
                }
            },
            "dataio_0":{
                "with_label": [false],
                "output_format": ["dense"]
            }
        }
    },
    "algorithm_parameters": {
        "ftl_0": {
            "epochs": 10,
            "mode": "plain",
            "optimizer": {
                "optimizer": "Adam",
                "learning_rate": 0.01
            },
            "alpha": 1,
            "tol": 0.00001,
            "batch_size": -1,
            "local_iter": 5,
            "communication_efficient": false,
            "nn_define": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "batch_input_shape": [null, 32], "dtype": "float32", "units": 16, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": 100, "dtype": "float32"}}, "bias_initializer": {"class_name": "Constant", "config": {"value": 0, "dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}
        },
        "evaluation_0": {
            "eval_type": "binary"
        }
    }
}