{
  "initiator": {
    "role": "guest",
    "party_id": 10000
  },
  "job_parameters": {
    "work_mode": 0
  },
  "role": {
    "guest": [
      10000
    ],
    "host": [
      10000
    ]
  },
  "role_parameters": {
    "guest": {
      "args": {
        "data": {
          "train_data": [
            {
              "name": "breast_b",
              "namespace": "hetero"
            }
          ],
          "eval_data": [
            {
              "name": "breast_b",
              "namespace": "hetero"
            }
          ]
        }
      },
      "dataio_0": {
        "with_label": [
          true
        ],
        "label_name": [
          "y"
        ],
        "label_type": [
          "int"
        ],
        "output_format": [
          "dense"
        ]
      },
      "hetero_nn_0": {
          "bottom_nn_define": [{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Dense", "config": {"name": "dense", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "units": 3, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": 1, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}],
          "interactive_layer_define": [{"class_name": "Sequential", "config": {"name": "sequential_3", "layers": [{"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "batch_input_shape": [null, 3], "dtype": "float32", "units": 2, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": 1, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}],
          "top_nn_define": [{"class_name": "Sequential", "config": {"name": "sequential_2", "layers": [{"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "batch_input_shape": [null, 2], "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": 1, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}]
      }
    },
    "host": {
      "args": {
        "data": {
          "train_data": [
            {
              "name": "breast_a",
              "namespace": "hetero"
            }
          ],
          "eval_data": [
            {
              "name": "breast_a",
              "namespace": "hetero"
            }
          ]
        }
      },
      "dataio_0": {
        "with_label": [
          false
        ],
        "label_type": [
          "int"
        ],
        "output_format": [
          "dense"
        ]
      },
      "hetero_nn_0": {
          "bottom_nn_define": [ {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "batch_input_shape": [null, 2], "dtype": "float32", "units": 3, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "Constant", "config": {"value": 1, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"} ]
       }
    }
  },
  "algorithm_parameters": {
    "hetero_nn_0": {
      "config_type": "keras",
      "batch_size": -1,
      "interactive_layer_lr": 0.15,
      "optimizer": {
        "optimizer": "SGD",
        "learning_rate": 0.15
      },
      "early_stop": "diff",
      "loss": "binary_crossentropy",
      "metrics": [
        "accuracy",
        "AUC"
      ],
      "epochs": 100,
      "validation_freqs": 1,
      "early_stopping_rounds": 10
    }
  }
}
